; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v4 - type_1 ?v5 - type_3)
 	      (pred_1 ?v7 - object ?v5 - type_3)
	      (pred_4 ?v4 - type_1 ?v2 - type_2)
	      (pred_2 ?v4 - type_1 ?v7 - object ?v2 - type_2))

   (:action op_3
       :parameters  (?v4 - type_1 ?v1 ?v8 - type_3)
       :precondition (and  (pred_3 ?v4 ?v1))
       :effect (and  (pred_3 ?v4 ?v8)
		     (not (pred_3 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_1 ?v6 - object ?v3 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v6 ?v3) (pred_3 ?v4 ?v3) (pred_4 ?v4 ?v2))
       :effect (and (pred_2 ?v4 ?v6 ?v2)
		    (not (pred_1 ?v6 ?v3)) 
		    (not (pred_4 ?v4 ?v2))))

   (:action op_2
       :parameters (?v4 - type_1 ?v6 - object ?v3 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_2 ?v4 ?v6 ?v2) (pred_3 ?v4 ?v3))
       :effect (and (pred_1 ?v6 ?v3)
		    (pred_4 ?v4 ?v2)
		    (not (pred_2 ?v4 ?v6 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_06 - type_1
obj_08 obj_02 obj_09 obj_10 - type_2
obj_13 obj_03 obj_11 obj_12 - type_3
obj_04 obj_05 obj_07 - object)
(:init
(pred_3 obj_01 obj_03)
(pred_4 obj_01 obj_08)
(pred_4 obj_01 obj_02)
(pred_3 obj_06 obj_03)
(pred_4 obj_06 obj_09)
(pred_4 obj_06 obj_10)
(pred_1 obj_04 obj_11)
(pred_1 obj_05 obj_13)
(pred_1 obj_07 obj_13)
)
(:goal
(and
(pred_1 obj_04 obj_03)
(pred_1 obj_05 obj_11)
(pred_1 obj_07 obj_11)
)
)

(:constraints
  (always (not (pred_3 obj_01 obj_11)))
)
)

; plan
1. (op_3 obj_01 obj_03 obj_13)
   deleted: (pred_3 obj_01 obj_03)
   added: (pred_3 obj_01 obj_13)
   goals met: 0 of 3
2. (op_3 obj_06 obj_03 obj_11)
   deleted: (pred_3 obj_06 obj_03)
   added: (pred_3 obj_06 obj_11)
   goals met: 0 of 3
3. (op_1 obj_06 obj_04 obj_11 obj_10)
   deleted: (pred_1 obj_04 obj_11) (pred_4 obj_06 obj_10)
   added: (pred_2 obj_06 obj_04 obj_10)
   goals met: 0 of 3
4. (op_1 obj_01 obj_07 obj_13 obj_02)
   deleted: (pred_1 obj_07 obj_13) (pred_4 obj_01 obj_02)
   added: (pred_2 obj_01 obj_07 obj_02)
   goals met: 0 of 3
5. (op_1 obj_01 obj_05 obj_13 obj_08)
   deleted: (pred_1 obj_05 obj_13) (pred_4 obj_01 obj_08)
   added: (pred_2 obj_01 obj_05 obj_08)
   goals met: 0 of 3
6. (op_3 obj_06 obj_11 obj_03)
   deleted: (pred_3 obj_06 obj_11)
   added: (pred_3 obj_06 obj_03)
   goals met: 0 of 3
7. (op_2 obj_01 obj_07 obj_13 obj_02)
   deleted: (pred_2 obj_01 obj_07 obj_02)
   added: (pred_1 obj_07 obj_13) (pred_4 obj_01 obj_02)
   goals met: 0 of 3
8. (op_2 obj_01 obj_05 obj_13 obj_08)
   deleted: (pred_2 obj_01 obj_05 obj_08)
   added: (pred_1 obj_05 obj_13) (pred_4 obj_01 obj_08)
   goals met: 0 of 3
9. (op_2 obj_06 obj_04 obj_03 obj_10)
   deleted: (pred_2 obj_06 obj_04 obj_10)
   added: (pred_1 obj_04 obj_03) (pred_4 obj_06 obj_10)
   goals met: 1 of 3
10. (op_3 obj_06 obj_03 obj_13)
   deleted: (pred_3 obj_06 obj_03)
   added: (pred_3 obj_06 obj_13)
   goals met: 1 of 3
11. (op_1 obj_06 obj_07 obj_13 obj_10)
   deleted: (pred_1 obj_07 obj_13) (pred_4 obj_06 obj_10)
   added: (pred_2 obj_06 obj_07 obj_10)
   goals met: 1 of 3
12. (op_3 obj_06 obj_13 obj_11)
   deleted: (pred_3 obj_06 obj_13)
   added: (pred_3 obj_06 obj_11)
   goals met: 1 of 3
13. (op_2 obj_06 obj_07 obj_11 obj_10)
   deleted: (pred_2 obj_06 obj_07 obj_10)
   added: (pred_1 obj_07 obj_11) (pred_4 obj_06 obj_10)
   goals met: 2 of 3
14. (op_3 obj_06 obj_11 obj_13)
   deleted: (pred_3 obj_06 obj_11)
   added: (pred_3 obj_06 obj_13)
   goals met: 2 of 3
15. (op_1 obj_06 obj_05 obj_13 obj_10)
   deleted: (pred_1 obj_05 obj_13) (pred_4 obj_06 obj_10)
   added: (pred_2 obj_06 obj_05 obj_10)
   goals met: 2 of 3
16. (op_3 obj_06 obj_13 obj_11)
   deleted: (pred_3 obj_06 obj_13)
   added: (pred_3 obj_06 obj_11)
   goals met: 2 of 3
17. (op_2 obj_06 obj_05 obj_11 obj_10)
   deleted: (pred_2 obj_06 obj_05 obj_10)
   added: (pred_1 obj_05 obj_11) (pred_4 obj_06 obj_10)
   goals met: 3 of 3
